#### ViewScheduleExportOptions Members

---

|  |
| --- |
| ViewScheduleExportOptions Class   Constructors   Methods   Properties   See Also |

The  ViewScheduleExportOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ViewScheduleExportOptions | Constructs a new instance of the ViewScheduleExportOptions class |
| Public method | ViewScheduleExportOptions(ViewScheduleExportOptions) | Constructs a new copy of the input ViewScheduleExportOptions object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ViewScheduleExportOptions |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ColumnHeaders | How to export column headers. Default is MultipleRows. |
| Public property | FieldDelimiter | How to delimit fields. Default is Tab. |
| Public property | HeadersFootersBlanks | Whether to export group headers, footers, and blank lines. Default is true. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | TextQualifier | How to qualify text fields. Default is DoubleQuote. |
| Public property | Title | Whether or not to export the schedule title. Default is true. |

# See Also

ViewScheduleExportOptions Class

Autodesk.Revit.DB Namespace